sle118/squeezelite-esp32/components/services/accessors.c
	// 1. List all GPIOs in the primary bank (lsb0)
	if (vol->lsb0 >= 0 && vol->width > 0) {
		for (int i = 0; i < vol->width; i++) {
			char name[16];
			snprintf(name, sizeof(name), "lsb0-%d", i);
			cJSON_AddItemToArray(ilist, get_gpio_entry(name, "vol", vol->lsb0 + i, false));
		}
	}

	// 2. List all GPIOs in the secondary bank (lsb1) if defined
	if (vol->lsb1 >= 0 && vol->width > 0) {
		for (int i = 0; i < vol->width; i++) {
			char name[16];
			snprintf(name, sizeof(name), "lsb1-%d", i);
			cJSON_AddItemToArray(ilist, get_gpio_entry(name, "vol", vol->lsb1 + i, false));
		}
	}

	// 3. Add the control/rail pins if defined
	if (vol->high0 >= 0) {
		cJSON_AddItemToArray(ilist, get_gpio_entry("high0", "vol", vol->high0, false));
	}
	if (vol->high1 >= 0) {
		cJSON_AddItemToArray(ilist, get_gpio_entry("high1", "vol", vol->high1, false));
	}

	return ilist;
}

/****************************************************************************************
 *
 */
cJSON * get_DAC_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	const i2s_platform_config_t * i2s_config= config_dac_get();
	if(i2s_config->pin.bck_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("bck","dac",i2s_config->pin.bck_io_num,is_dac_config_locked()));
		cJSON_AddItemToArray(llist,get_gpio_entry("ws","dac",i2s_config->pin.ws_io_num,is_dac_config_locked()));
		cJSON_AddItemToArray(llist,get_gpio_entry("do","dac",i2s_config->pin.data_out_num,is_dac_config_locked()));
		if(i2s_config->sda>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("sda","dac",i2s_config->sda,is_dac_config_locked()));
			cJSON_AddItemToArray(llist,get_gpio_entry("scl","dac",i2s_config->scl,is_dac_config_locked()));
		}
		if(i2s_config->mute_gpio>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("mute","dac",i2s_config->mute_gpio,is_dac_config_locked()));
		}
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_Display_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	const display_config_t * config= config_display_get();
	if(config->back >=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("backlight","display",config->back,false));
	}
	if(config->CS_pin >=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("CS","display",config->CS_pin,false));
	}	
	if(config->RST_pin >=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("reset","display",config->RST_pin,false));
	}
	return llist;
}
/****************************************************************************************
 *
 */
cJSON * get_I2C_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	int port=0;
	const i2c_config_t * i2c_config = config_i2c_get(&port);
	if(i2c_config->scl_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("scl","i2c",i2c_config->scl_io_num,false));
		cJSON_AddItemToArray(llist,get_gpio_entry("sda","i2c",i2c_config->sda_io_num,false));
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_SPI_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	spi_host_device_t spi_host;
	const spi_bus_config_t * spi_config = config_spi_get(&spi_host);
	
	if(spi_config->miso_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("data","spi",spi_config->miso_io_num,false));
		cJSON_AddItemToArray(llist,get_gpio_entry("data","clk",spi_config->sclk_io_num,false));
	}
	if(spi_system_dc_gpio>0){
		cJSON_AddItemToArray(llist,get_gpio_entry("data","dc",spi_system_dc_gpio,false));
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_eth_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	spi_host_device_t spi_host;
	const eth_config_t * eth_config = config_eth_get(&spi_host);
	#if defined(CONFIG_ETH_CONFIG)
		bool fixed = strlen(CONFIG_ETH_CONFIG)>0;
	#else
		bool fixed =false;
	#endif 
	if(eth_config->valid ){
		add_gpio_for_value(llist,"mdc",eth_config->mdc,"ethernet",fixed);
		add_gpio_for_value(llist,"rst",eth_config->rst,"ethernet",fixed);
		add_gpio_for_value(llist,"mdio",eth_config->mdio,"ethernet",fixed);
		if(eth_config->rmii){
			add_gpio_for_value(llist,"tx_en", 21,"ethernet",true);
			add_gpio_for_value(llist,"tx0",   19 ,"ethernet",true);
			add_gpio_for_value(llist,"tx1",   22 ,"ethernet",true);
			add_gpio_for_value(llist,"rx0",   25 ,"ethernet",true);
			add_gpio_for_value(llist,"rx1",   26 ,"ethernet",true);
			add_gpio_for_value(llist,"crs_dv",27 ,"ethernet",true);
		}
		else if(eth_config->spi) {
			/* SPI ethernet */
			add_gpio_for_value(llist,"cs",eth_config->cs,"ethernet",fixed);
			add_gpio_for_value(llist,"mosi",eth_config->mosi,"ethernet",fixed);
			add_gpio_for_value(llist,"miso",eth_config->miso,"ethernet",fixed);
			add_gpio_for_value(llist,"intr",eth_config->intr,"ethernet",fixed);
			add_gpio_for_value(llist,"clk",eth_config->clk,"ethernet",fixed);
		}
	}
	return llist;
}


/****************************************************************************************
 *
 */
cJSON * get_SPDIF_GPIO(cJSON * list, bool fixed){
	cJSON * llist = list?list:cJSON_CreateArray();
	char * spdif_config = config_spdif_get_string();
	if(spdif_config){
		llist = add_gpio_for_name(llist,spdif_config,"bck", "spdif", fixed);
		llist = add_gpio_for_name(llist,spdif_config,"ws",  "spdif", fixed);
		llist = add_gpio_for_name(llist,spdif_config,"do",  "spdif", fixed);
		free(spdif_config);	
	}	
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_Rotary_GPIO(cJSON * list){
	cJSON * llist = list?list:cJSON_CreateArray();

	const rotary_struct_t *rotary= config_rotary_get();
	add_gpio_for_value(llist,"A",rotary->A, "rotary", false);
	add_gpio_for_value(llist,"B",rotary->B, "rotary", false);
	add_gpio_for_value(llist,"SW",rotary->SW, "rotary", false);
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_ledvu_GPIO(cJSON * list){
	cJSON * llist = list?list:cJSON_CreateArray();

	const ledvu_struct_t *ledvu= config_ledvu_get();
	add_gpio_for_value(llist,"gpio",ledvu->gpio, "led_vu", false);
	return llist;
}

/****************************************************************************************
 *
 */
esp_err_t get_gpio_structure(cJSON * gpio_entry, gpio_entry_t ** gpio){
	esp_err_t err = ESP_OK;
	*gpio = malloc_init_external(sizeof(gpio_entry_t));
	cJSON * val = cJSON_GetObjectItem(gpio_entry,"gpio");
	if(val){
		(*gpio)->gpio= (int)val->valuedouble;
	} else {
		ESP_LOGE(TAG,"gpio pin not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"name");
	if(val){
		(*gpio)->name= strdup_psram(cJSON_GetStringValue(val));
	} else {
		ESP_LOGE(TAG,"gpio name value not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"group");
	if(val){
		(*gpio)->group= strdup_psram(cJSON_GetStringValue(val));
	} else {
		ESP_LOGE(TAG,"gpio group value not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"fixed");
	if(val){
		(*gpio)->fixed= cJSON_IsTrue(val);
	} else {
		ESP_LOGE(TAG,"gpio fixed indicator not found");
		err=ESP_FAIL;
	}

